# What you will learn in this notebook

In this notebook we will cover the following:

1. Dataframes 
    1. Making dataframes from series
    2. What if my data isn't a pandas Series?
    3. Getting the index and column values
2. Previewing and describing a DataFrame
    1. Previewing the DataFrame or part of it
    2. Retrieving DataFrame information
3. Reading data from files into pandas dataframes
4. Writing data from pandas into files

# Imports

In [1]:
import pandas as pd
import os

# What is a DataFrame

A 2D, potentially heterogenous, tabular structure. It can be thought of as a container of Series. It is also possible to have 1-dimensional dataframes (dataframes with one column). The documentation on DataFrame is available on the `pandas.DataFrame` [documentation page](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html) 

Below is an example of a DataFrame with Pok√©mon characteristics. Notice the different datatypes - numeric, string, and boolean.


![](../media/pokemon.png)

Let's create our first DataFrame:

In [2]:
df1 = pd.DataFrame([10,122,1])
df1

     0
0   10
1  122
2    1

Now this might look like a pandas Series on the first sight, but it behaves differently in some ways (and similarly in others). The DataFrame has an index as a Series, but additionally it has column names (the zero above the horizontal line in this example). Remember that when printing Series, pandas automatically printed the `datatype`? It does not happen with the DataFrame. The DataFrame as a whole does not have a datatype, but each of its columns does.

Let's print the dataframe column. We use **square brackets** with the column name to select it. In this case, the **column name** is just a number. (If you remember from the Series section, this was the way to select the Series rows - the first difference!)


A DataFrame column called in this way is actually a pandas `Series`:

In [3]:
df1[0] # this selects the column with name 0

0     10
1    122
2      1
Name: 0, dtype: int64

You can select a column and have the result be a dataframe using **double brackets**:

You probably guessed by the look of it that this is a `DataFrame`! 

Remember: 

1. one pair of brackets --> **Series**
2. two pairs of brackets --> **DataFrame**

Now on to a dataframe with more columns. We will also pass a list of `column names` and another list for the `index`, using the appropriate arguments.

In [9]:
# ignore the weird spacing, it's just to make clear that we have 3 lists of 3 elements
# notice that this is a list of lists

df2 = pd.DataFrame([[1,   2,   7],  
                    [4.2, 6.1, -4.1], 
                    ["a", "b", "z"] ],
                    columns=['col1','col2','col3'],  # <- column names
                    index=['row1','row2','row3'])    # <- row names
df2

     col1 col2 col3
row1    1    2    7
row2  4.2  6.1 -4.1
row3    a    b    z

In [10]:
df2.loc['row1',['col2','col3']]

col2    2
col3    7
Name: row1, dtype: object

Looking at the result, we can see that each list represents a row. What if you want to input the values by columns? You can use `dictionaries`:

In [12]:
df3=pd.DataFrame(data = { 'col1':[1,   2,   7],  
                   'col2':[4.2, 6.1, -4.1], 
                   'col3':["a", "b", "z"] 
                 },
                 index=['row1','row2','row3']
                )
df3

      col1  col2 col3
row1     1   4.2    a
row2     2   6.1    b
row3     7  -4.1    z

Very often, your data comes in lists, including the column names. It's easy to zip them into a `dictionary`

In [13]:
column_names=["company","founder_name","founder_surname"]

company = ["PiggyVest","Bumble","Backstage Capital","Blendoor","LungXpert", "Cisco","Eventbrite",
                "Adafruit Industries","Verge Genomics","23andme"]
founder_name = ["Odunayo","Whitney","Arlan","Stephanie","Sasikala","Sandy","Julia","Limor","Alice","Anne"]
founder_surname = ["Eweniyi","Wolfe Heard","Hamilton","Lampkin","Devi","Lerner","Hartz","Fried","Zhang","Wojcicki"]

In [16]:
tech_companies_dictionary=dict(zip(column_names,[company,founder_name,founder_surname]))
tech_companies_dictionary

{'company': ['PiggyVest',
  'Bumble',
  'Backstage Capital',
  'Blendoor',
  'LungXpert',
  'Cisco',
  'Eventbrite',
  'Adafruit Industries',
  'Verge Genomics',
  '23andme'],
 'founder_name': ['Odunayo',
  'Whitney',
  'Arlan',
  'Stephanie',
  'Sasikala',
  'Sandy',
  'Julia',
  'Limor',
  'Alice',
  'Anne'],
 'founder_surname': ['Eweniyi',
  'Wolfe Heard',
  'Hamilton',
  'Lampkin',
  'Devi',
  'Lerner',
  'Hartz',
  'Fried',
  'Zhang',
  'Wojcicki']}

... then pass it to a `DataFrame`

In [17]:
df6 = pd.DataFrame(tech_companies_dictionary)
df6

               company founder_name founder_surname
0            PiggyVest      Odunayo         Eweniyi
1               Bumble      Whitney     Wolfe Heard
2    Backstage Capital        Arlan        Hamilton
3             Blendoor    Stephanie         Lampkin
4            LungXpert     Sasikala            Devi
5                Cisco        Sandy          Lerner
6           Eventbrite        Julia           Hartz
7  Adafruit Industries        Limor           Fried
8       Verge Genomics        Alice           Zhang
9              23andme         Anne        Wojcicki

# Making DataFrames from Series

In [18]:
# Let's say we have these lists somewhere on our computer: 
column_names=["company","founder_name","founder_surname"]

company = ["PiggyVest","Bumble","Backstage Capital","Blendoor","LungXpert", "Cisco","Eventbrite",
                "Adafruit Industries","Verge Genomics","23andme"]
founder_name = ["Odunayo","Whitney","Arlan","Stephanie","Sasikala","Sandy","Julia","Limor","Alice","Anne"]
founder_surname = ["Eweniyi","Wolfe Heard","Hamilton","Lampkin","Devi","Lerner","Hartz","Fried","Zhang","Wojcicki"]

Let's make some series, using the company name as index:

In [20]:
series_of_founder_names = pd.Series(data=founder_name, # <-- data 
                                    index=company,     # <-- index 
                                   )
series_of_founder_names

PiggyVest                Odunayo
Bumble                   Whitney
Backstage Capital          Arlan
Blendoor               Stephanie
LungXpert               Sasikala
Cisco                      Sandy
Eventbrite                 Julia
Adafruit Industries        Limor
Verge Genomics             Alice
23andme                     Anne
dtype: object

Same thing, this time for surnames:

In [22]:
series_of_founder_surnames = pd.Series(data=founder_surname, # <-- different data
                                       index=company,           # <-- same index 
                                      )
series_of_founder_surnames

PiggyVest                  Eweniyi
Bumble                 Wolfe Heard
Backstage Capital         Hamilton
Blendoor                   Lampkin
LungXpert                     Devi
Cisco                       Lerner
Eventbrite                   Hartz
Adafruit Industries          Fried
Verge Genomics               Zhang
23andme                   Wojcicki
dtype: object

Now with these two series we can create a dataframe! Pandas will notice that they have the same index, and will give the dataframe that index:

In [23]:
df7 = pd.DataFrame({'founder_name': series_of_founder_names,  
                    'founder_surname': series_of_founder_surnames})
df7

                    founder_name founder_surname
PiggyVest                Odunayo         Eweniyi
Bumble                   Whitney     Wolfe Heard
Backstage Capital          Arlan        Hamilton
Blendoor               Stephanie         Lampkin
LungXpert               Sasikala            Devi
Cisco                      Sandy          Lerner
Eventbrite                 Julia           Hartz
Adafruit Industries        Limor           Fried
Verge Genomics             Alice           Zhang
23andme                     Anne        Wojcicki

Other ways you can `concatenate` two or more series into a dataframe:

In [25]:
pd.concat([series_of_founder_names, series_of_founder_surnames],axis=1)

                             0            1
PiggyVest              Odunayo      Eweniyi
Bumble                 Whitney  Wolfe Heard
Backstage Capital        Arlan     Hamilton
Blendoor             Stephanie      Lampkin
LungXpert             Sasikala         Devi
Cisco                    Sandy       Lerner
Eventbrite               Julia        Hartz
Adafruit Industries      Limor        Fried
Verge Genomics           Alice        Zhang
23andme                   Anne     Wojcicki

Wait a minute, where are our expected `column names`?

Pandas filled the columns names automatically like it always does. When concatenating multiple series to form a dataframe, pandas will use the `.name` attribute of each series as a column.

In [26]:
series_of_founder_names.name

But this returned nothing, which means our series don't have a name. Let's name them!

In [27]:
series_of_founder_names = series_of_founder_names.rename('founder_name')
series_of_founder_surnames = series_of_founder_surnames.rename('founder_surname')

And now we try again

|We stopped here|

In [28]:
pd.concat([series_of_founder_names, series_of_founder_surnames],axis=1)

                    founder_name founder_surname
PiggyVest                Odunayo         Eweniyi
Bumble                   Whitney     Wolfe Heard
Backstage Capital          Arlan        Hamilton
Blendoor               Stephanie         Lampkin
LungXpert               Sasikala            Devi
Cisco                      Sandy          Lerner
Eventbrite                 Julia           Hartz
Adafruit Industries        Limor           Fried
Verge Genomics             Alice           Zhang
23andme                     Anne        Wojcicki

great!

## What if the data you are merging does not have the same index?

Let's try to another another info about each company: the **number of employees** they have.

In [21]:
number_of_employees = [71, 700, 12, 20, 10, 79500, 1000, 105, 49, 683]

series_number_of_employees = pd.Series(data=number_of_employees) # <-- data, no index 
# this has an index, although we did not pass it - Series always has an index
series_number_of_employees

0       71
1      700
2       12
3       20
4       10
5    79500
6     1000
7      105
8       49
9      683
dtype: int64

Now, you may be tempted to add this series directly to the dataframe, and pandas won't stop you:

In [22]:
df8 = pd.DataFrame({'founder_name': series_of_founder_names,  
                    'founder_surname': series_of_founder_surnames,
                    'number_employees': series_number_of_employees})
df8

                    founder_name founder_surname  number_employees
0                            NaN             NaN              71.0
1                            NaN             NaN             700.0
2                            NaN             NaN              12.0
3                            NaN             NaN              20.0
4                            NaN             NaN              10.0
5                            NaN             NaN           79500.0
6                            NaN             NaN            1000.0
7                            NaN             NaN             105.0
8                            NaN             NaN              49.0
9                            NaN             NaN             683.0
23andme                     Anne        Wojcicki               NaN
Adafruit Industries        Limor           Fried               NaN
Backstage Capital          Arlan        Hamilton               NaN
Blendoor               Stephanie         Lampkin               NaN
Bumble                   Whitney     Wolfe Heard               NaN
Cisco                      Sandy          Lerner               NaN
Eventbrite                 Julia           Hartz               NaN
LungXpert               Sasikala            Devi               NaN
PiggyVest                Odunayo         Eweniyi               NaN
Verge Genomics             Alice           Zhang               NaN

![](../media/what-the-hell-is-this.jpg)

When joining multiple `series` into a `dataframe`, `Pandas` will create a row for each unique index value present in all of the series. Then starts to fill the column values of each row wherever the index match. Unfortunately the first 2 series don't match any index of the this 3rd series we merged into, generating this mess.

Remember to **think about the index** when combining `series` into `dataframes`!

In [23]:
series_number_of_employees_indexed = pd.Series(data=number_of_employees,index=company)
df9 = pd.DataFrame({'founder_name': series_of_founder_names,  
                    'founder_surname': series_of_founder_surnames,
                    'number_employees': series_number_of_employees_indexed})
df9

                    founder_name founder_surname  number_employees
PiggyVest                Odunayo         Eweniyi                71
Bumble                   Whitney     Wolfe Heard               700
Backstage Capital          Arlan        Hamilton                12
Blendoor               Stephanie         Lampkin                20
LungXpert               Sasikala            Devi                10
Cisco                      Sandy          Lerner             79500
Eventbrite                 Julia           Hartz              1000
Adafruit Industries        Limor           Fried               105
Verge Genomics             Alice           Zhang                49
23andme                     Anne        Wojcicki               683

That's better!

# Getting the index and column values

The `DataFrame object contains a few attributes that are useful for getting an overview of your data.

Get the index (row names), with `.index`:

In [24]:
df9.index

Index(['PiggyVest', 'Bumble', 'Backstage Capital', 'Blendoor', 'LungXpert',
       'Cisco', 'Eventbrite', 'Adafruit Industries', 'Verge Genomics',
       '23andme'],
      dtype='object')

Get the column names, with `.columns`:

In [25]:
df9.columns

Index(['founder_name', 'founder_surname', 'number_employees'], dtype='object')

Among other things, this might be used to **iterate** over the column names:

In [26]:
for col in df9.columns:
    print(col)

founder_name
founder_surname
number_employees

We can also use `dtypes` to know the type of each column in the dataframe:

In [27]:
df9.dtypes

founder_name        object
founder_surname     object
number_employees     int64
dtype: object

To get the underlying data as an array, use `.to_numpy()` or `.values`. The array will be 2D, as the dataframe.

In [32]:
df9.to_numpy()

array([['Odunayo', 'Eweniyi', 71],
       ['Whitney', 'Wolfe Heard', 700],
       ['Arlan', 'Hamilton', 12],
       ['Stephanie', 'Lampkin', 20],
       ['Sasikala', 'Devi', 10],
       ['Sandy', 'Lerner', 79500],
       ['Julia', 'Hartz', 1000],
       ['Limor', 'Fried', 105],
       ['Alice', 'Zhang', 49],
       ['Anne', 'Wojcicki', 683]], dtype=object)

In [33]:
df9.values

array([['Odunayo', 'Eweniyi', 71],
       ['Whitney', 'Wolfe Heard', 700],
       ['Arlan', 'Hamilton', 12],
       ['Stephanie', 'Lampkin', 20],
       ['Sasikala', 'Devi', 10],
       ['Sandy', 'Lerner', 79500],
       ['Julia', 'Hartz', 1000],
       ['Limor', 'Fried', 105],
       ['Alice', 'Zhang', 49],
       ['Anne', 'Wojcicki', 683]], dtype=object)

# Previewing and Describing a DataFrame

In a jupyter notebook, calling a DataFrame will display it (as seen previously):

In [34]:
df9

                    founder_name founder_surname  number_employees
PiggyVest                Odunayo         Eweniyi                71
Bumble                   Whitney     Wolfe Heard               700
Backstage Capital          Arlan        Hamilton                12
Blendoor               Stephanie         Lampkin                20
LungXpert               Sasikala            Devi                10
Cisco                      Sandy          Lerner             79500
Eventbrite                 Julia           Hartz              1000
Adafruit Industries        Limor           Fried               105
Verge Genomics             Alice           Zhang                49
23andme                     Anne        Wojcicki               683

If the dataframe has a lot of entries, it will be only partially displayed. Nonetheless, it might still be too much information being displayed at once. An alternative are the `.head()` and `.tail()` methods which print only a certain number of entries from the top and bottom of the dataframe, respectively.

In [35]:
df9.head(n=2)

          founder_name founder_surname  number_employees
PiggyVest      Odunayo         Eweniyi                71
Bumble         Whitney     Wolfe Heard               700

In [36]:
df9.tail(n=3)

                    founder_name founder_surname  number_employees
Adafruit Industries        Limor           Fried               105
Verge Genomics             Alice           Zhang                49
23andme                     Anne        Wojcicki               683

## Retrieving DataFrame Information

`.shape` returns a tuple with the dimensions of the dataframe (number_of_rows, number_of_columns).

In [37]:
df9.shape

(10, 3)

With `.info()`, we obtain:

- the number of entries
- the number of columns
- the title of each column
- the number of entries that in fact exists in each column (does not consider missing values!)
- the type of data of the entries of a given column.

In [38]:
df9.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, PiggyVest to 23andme
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   founder_name      10 non-null     object
 1   founder_surname   10 non-null     object
 2   number_employees  10 non-null     int64
dtypes: int64(1), object(2)
memory usage: 620.0+ bytes

For the numerical columns it's also possible to obtain basic statistical information using `.describe()`:

- the number of rows for each numerical column
- the mean value
- the standard deviation
- the minimum and maximum value
- the median, the 25th and 75th percentile.

In [39]:
df9.describe()

       number_employees
count         10.000000
mean        8215.000000
std        25049.647037
min           10.000000
25%           27.250000
50%           88.000000
75%          695.750000
max        79500.000000

# Read data from files into pandas dataframes

Pandas has functions that allow us to create `dataframes` form several different types of data `files`:

- CSV
- JSON
- HTML
- ... and [many more](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)

All of this is possible by using the `pd.read_` methods.

For instance, using the 2010 census profile and housing characteristics of the city of Los Angeles ([source](https://catalog.data.gov/dataset/2010-census-populations-by-zip-code)):

In [44]:
census_2010 = pd.read_csv(os.path.join("..","data","2010_Census_Populations_by_Zip_Code.csv"))

This is the resulting DataFrame:

In [45]:
census_2010.head()

,Zip Code,Total Population,Median Age,Total Males,Total Females,Total Households,Average Household Size
0,91371,1,73.5,0,1,1,1.00
1,90001,57110,26.6,28468,28642,12971,4.40
2,90002,51223,25.5,24876,26347,11731,4.36
3,90003,66266,26.3,32631,33635,15642,4.22
4,90004,62180,34.8,31302,30878,22547,2.73

It's shape is:

In [46]:
census_2010.shape

(319, 7)

Let's use `.info()` to get an overview of the column variables:

In [48]:
census_2010.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 319 entries, 0 to 318
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Zip Code                319 non-null    int64
 1   Total Population        319 non-null    int64
 2   Median Age              319 non-null    float64
 3   Total Males             319 non-null    int64
 4   Total Females           319 non-null    int64
 5   Total Households        319 non-null    int64
 6   Average Household Size  319 non-null    float64
dtypes: float64(2), int64(5)
memory usage: 17.6 KB

Wait pandas thinks the zip code is a numerical column, let's change that:

In [55]:
census_2010 = census_2010.astype({'Zip Code':str})
census_2010.dtypes

Zip Code                   object
Total Population            int64
Median Age                float64
Total Males                 int64
Total Females               int64
Total Households            int64
Average Household Size    float64
dtype: object

Fixed!

And `.describe()` for basic statistics:

In [56]:
census_2010.describe()

,Total Population,Median Age,Total Males,Total Females,Total Households,Average Household Size
count,319.000000,319.000000,319.000000,319.000000,319.000000,319.000000
mean,33241.341693,36.527586,16391.564263,16849.777429,10964.570533,2.828119
std,21644.417455,8.692999,10747.495566,10934.986468,6270.646400,0.835658
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,19318.500000,32.400000,9763.500000,9633.500000,6765.500000,2.435000
50%,31481.000000,37.100000,15283.000000,16202.000000,10968.000000,2.830000
75%,44978.000000,41.000000,22219.500000,22690.500000,14889.500000,3.320000
max,105549.000000,74.000000,52794.000000,53185.000000,31087.000000,4.670000

# Writing data from pandas into files

Besides reading from the disk, Pandas allows us to save our dataframe to a file.

In [57]:
census_2010.to_csv(os.path.join("..","data","new_csv.csv"))

You should now have a new file called `new_csv.csv` in your `data` folder!

The same way we can read data from various files types, we can also write data to various file types (CSV, JSON, HTML, ...) All of this is possible by using the to_dataFormat method, giving as an argument the path where you want to save the file. For example, you can write to the JSON format using `to_json`, or to an Excel spreadsheet using `to_excel`, and so on.

# Useful Links

- [Pandas Getting Started tutorials](https://pandas.pydata.org/pandas-docs/stable/getting_started/intro_tutorials/index.html)


- [Intro to data structures](https://pandas.pydata.org/pandas-docs/stable/dsintro.html)